#include "const.h"

using namespace std;

map<string, string> disciplines = {
    {"1", "Физика"},
    {"2", "Линейная алгебра и аналитическая геометрия"},
    {"3", "Математический анализ"},
    {"4", "История России"},
    {"5", "Иностранный язык"}
};

map<string, vector<string>> themes = {
    {"1", {"Электричество", "Мкт", "Кинематика", "Механика", "Магнетизм"}},
    {"2", {"Матрицы", "Определители", "СЛАУ", "Пространства", "Операторы"}},
    {"3", {"Пределы", "Производные", "Дифферинциал", "Интегралы", "Тейлор"}},
    {"4", {"Древняя Русь ", "Рюриковичи", "Смута", "Романовы", "Великая Отечественная Война"}},
    {"5", {"Грамматика", "Лексика", "Синтаксис", "Аудирование", "Чтение"}}};

vector<string> dates = {
    "01.09.2020", "08.09.2020", "15.09.2020", "22.09.2020", "29.09.2020",
    "06.10.2020", "13.10.2020", "20.10.2020", "27.10.2020",
    "03.11.2020", "10.11.2020", "17.11.2020", "24.11.2020",
    "01.12.2020", "08.12.2020", "15.12.2020", "22.12.2020", "29.12.2020",
    "05.01.2021", "12.01.2021", "19.01.2021", "26.01.2021",
    "02.02.2021", "09.02.2021", "16.02.2021", "23.02.2021",
    "02.03.2021", "09.03.2021", "16.03.2021", "23.03.2021", "30.03.2021",
    "03.05.2022", "10.05.2022", "17.05.2022", "24.05.2022", "31.05.2022"};  