#!/bin/bash

date | awk 'BEGIN {
    array["Пн"] = "Понедельник"
    array["Вт"] = "Вторник"
    array["Ср"] = "Среда"
    array["Чт"] = "Четверг"
    array["Пт"] = "Пятница"
    array["Сб"] = "Суббота"
    array["Вс"] = "Воскресенье"

    array["янв"] = "Января"
    array["фев"] = "Февраля"
    array["мар"] = "Марта"
    array["апр"] = "Апреля"
    array["мая"] = "Мая"
    array["июн"] = "Июня"
    array["июл"] = "Июля"
    array["авг"] = "Августа"
    array["сен"] = "Сентября"
    array["окт"] = "Октября"
    array["ноя"] = "Ноября"
    array["дек"] = "Декабря"
}
{
    print "сегодня " array[$1] " "$2 " " array[$3]

}
'
